{
 "@search.score": 1.0,
 "speakerId": "719756",
 "attendeeId": "7271e2cc-6d09-433a-8200-37abbea2ceb2",
 "firstName": "Anca",
 "lastName": "Ventura",
 "displayName": "Anca Ventura",
 "jobTitle": "Sr. Product Marketing Lead",
 "company": "Microsoft",
 "bio": "Anca Ventura is Senior Product Marketing Manager for the Surface commercial business in the Microsoft Middle East and Africa region. Anca arrived to MEA in 2018 from Microsoft Corporation Redmond, U.S.A, where she acted as a Senior Product Marketing Manager in the Windows & Devices global marketing team. Prior to her role at Microsoft Corporation Redmond, she worked as Senior Product Marketing Manager for Microsoft Mobile Device Sales with 18 countries in the Middle East, Near East, Emerging Asia, North Africa, Levant, Turkey and Israel. During her tenure at Microsoft, Anca was highly recognized for successfully driving the long-term direction and the go-to-market for the most innovative and high-profile Microsoft and Windows features and devices including Microsoft Surface, Windows Hello & Security, and Windows Mixed Reality. Anca achieved multiple awards and distinctions in her professional career. She brings an overall successful track record of 19+ years in managing and expanding hardware, software and services categories attaining sales and profitability targets on global scale businesses for Microsoft, Nokia, Siemens, and Vodafone. Having lived and worked in Central & Eastern Europe, Western Europe, Middle East and Africa, and in the United States, she also brings strong cross-cultural and cross-regional intelligence. Originally from Bucharest, Romania, Anca lives in Dubai, United Arab Emirates. Anca has an MBA from the Washington State University, Washington State, United States of America, in progress, and she earned a bachelor’s degree in international business from the Bucharest University of Economics Studies.",
 "photo": "https://1384msignitetoprodeast.blob.core.windows.net/23478avatar/r/4555835/biggest.png",
 "blog": "",
 "twitter": "",
 "linkedIn": "",
 "facebook": "",
 "website": "",
 "sessionsPresenting": [
  "90724"
 ],
 "sessionSets": [
  "Session Catalog 2019",
  "Session Scheduler",
  "My Schedule"
 ],
 "products": [],
 "levels": [
  ""
 ],
 "priorityTrack": [],
 "format": [
  ""
 ],
 "staffingDetails": "",
 "assignmentName": "",
 "assignmentType": "",
 "currentLocation": "",
 "assignmentStart": null,
 "assignmentEnd": null,
 "currentLocationOriginalSerial": "",
 "liveLocation": false,
 "fullName": "Anca Ventura",
 "lastUpdate": "2020-01-27T19:00:14.329+00:00"
}