{
 "@search.score": 1.0,
 "canUserModifySchedule": true,
 "isCapacityControlled": false,
 "roomHasCapacity": true,
 "rsvpOpensAt": "2020-02-10T02:00:00+00:00",
 "hasRsvpOpened": false,
 "hasRsvpClosed": false,
 "waitlistHasCapacity": true,
 "capacity": 280,
 "attendeeCount": 33,
 "sessionId": "86525",
 "sessionInstanceId": "86525",
 "sessionCode": "COMP20",
 "sessionCodeNormalized": "COMP20",
 "title": "Identify and take action on insider risks, threats and code of conduct violations",
 "sortTitle": "identify and take action on insider risks, threats and code of conduct violations",
 "sortRank": 2147483647,
 "description": "Insider threats and policy violations are a major risk for all companies and can easily go undetected until it is too late.  Proactively managing these risks and threats can provide you with a game changing advantage.  Gain a deeper understanding of how to gain visibility into and take action on insider threats, data leakage and policy violations.  Come learn about how the new Microsoft 365 Insider Risk Management and Communication Compliance solutions correlate multiple signals, from activities to communications, to give you a proactive view into potential threats and take remediate actions as appropriate.",
 "registrationLink": "",
 "roomId": "",
 "location": "Sheikh Maktoum Hall C",
 "buildingLocation": null,
 "startDateTime": "2020-02-10T08:15:00+00:00",
 "endDateTime": "2020-02-10T09:00:00+00:00",
 "durationInMinutes": 45,
 "sessionType": "Module: 45 Minute",
 "sessionTypeLogical": "Module: 45 Minute",
 "learningPath": "Meeting organizational compliance requirements",
 "level": "Advanced (300)",
 "products": [],
 "format": "",
 "topic": "Compliance",
 "sessionTypeId": "3107",
 "slideDeck": "",
 "isMandatory": false,
 "visibleToAnonymousUsers": true,
 "visibleInSessionListing": true,
 "canBeEvaluated": true,
 "liveStream": "",
 "onDemand": "",
 "translatorLink": "",
 "onDemandThumbnail": "",
 "techCommunityDiscussionId": "907364",
 "speakerIds": [
  "669942"
 ],
 "speakerNames": [
  "AMIT BHATIA"
 ],
 "speakerCompanies": [
  "MSFT"
 ],
 "sessionSets": [
  "Session Catalog 2019",
  "Session Scheduler",
  "My Schedule"
 ],
 "sessionLinks": [],
 "marketingCampaign": [],
 "overflowStatus": "",
 "links": "",
 "waitlistCapacity": 2147483647,
 "waitlistCount": 0,
 "lastUpdate": "2020-01-31T03:30:14.801+00:00",
 "techCommunityUrl": "",
 "overflowRooms": [],
 "childModules": [],
 "siblingModules": [
  {
   "sessionId": 86527,
   "title": "Know your data: use intelligence to identify, protect and govern your important data",
   "startDateTime": "2020-02-10T06:45:00+00:00",
   "endDateTime": "2020-02-10T07:45:00+00:00",
   "durationInMinutes": 60,
   "speakerIds": [
    "723474"
   ],
   "speakerNames": [
    "Sandeep Ravindran"
   ],
   "speakerCompanies": [],
   "description": "Knowing your data, where it is stored, what is business critical, what is sensitive and needs to be protected, what should be kept and what can be deleted is an absolute priority.  In this session you will gain a deeper understanding of the new intelligent capabilities to assess the risks you face and how to reduce that risk by automatically classifying, labeling and protecting and governing data where it lives across your environment, endpoints, apps and services.",
   "location": "Sheikh Maktoum Hall C"
  },
  {
   "sessionId": 86564,
   "title": "Take control of your data explosion with intelligent Information Governance",
   "startDateTime": "2020-02-10T10:00:00+00:00",
   "endDateTime": "2020-02-10T10:45:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "716951"
   ],
   "speakerNames": [
    "Rami Calache"
   ],
   "speakerCompanies": [],
   "description": "As data explodes in the modern workplace organizations recognize data is an asset but also a liability. Learn how Microsoft 365 can help your customers establish a comprehensive information governance strategy to intelligently manage your data lifecycle, keep what is important and delete what isn't.",
   "location": "Sheikh Maktoum Hall C"
  },
  {
   "sessionId": 86565,
   "title": "eDiscovery and Audit: Harnessing intelligent and end-to-end solutions to improve results and lower costs​",
   "startDateTime": "2020-02-10T11:15:00+00:00",
   "endDateTime": "2020-02-10T12:00:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "669942"
   ],
   "speakerNames": [
    "AMIT BHATIA"
   ],
   "speakerCompanies": [],
   "description": "Organizations are required often to quickly find relevant information related to investigations, litigation or regulatory requests.  However, discovering relevant information an organization needs when it is needed is both difficult and expensive.  Our Advanced e-discovery and Audit capabilities enable you to quickly find relevant data and respond efficiently.  Come find out how you can reduce risk, time and cost in data discovery and remediation processes.  It’s applicable in a variety of scenarios, including litigations, internal investigations, privacy regulations and beyond.",
   "location": "Sheikh Maktoum Hall C"
  },
  {
   "sessionId": 86566,
   "title": "Supercharge your ability to simplify IT compliance and reduce risk with Microsoft Compliance Score",
   "startDateTime": "2020-02-10T12:30:00+00:00",
   "endDateTime": "2020-02-10T13:15:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "715281",
    "716951"
   ],
   "speakerNames": [
    "Ahmed Khairy",
    "Rami Calache"
   ],
   "speakerCompanies": [],
   "description": "Continuously assessing, improving and monitoring the effectiveness of your security and privacy controls is a top priority for all companies today. The new Compliance Score can automatically assess controls implemented in your system and get recommended actions and tools to improve your risk profile on an ongoing basis. Come find out how Compliance Score can help you demystify compliance and make you the hero admins to help your organization manage risks and compliance.",
   "location": "Sheikh Maktoum Hall C"
  }
 ]
}