{
 "@search.score": 1.0,
 "canUserModifySchedule": true,
 "isCapacityControlled": false,
 "roomHasCapacity": true,
 "rsvpOpensAt": "2020-02-10T02:00:00+00:00",
 "hasRsvpOpened": false,
 "hasRsvpClosed": false,
 "waitlistHasCapacity": true,
 "capacity": 400,
 "attendeeCount": 119,
 "sessionId": "86432",
 "sessionInstanceId": "86432",
 "sessionCode": "AFUN40",
 "sessionCodeNormalized": "AFUN40",
 "title": "Azure security fundamentals",
 "sortTitle": "azure security fundamentals",
 "sortRank": 2147483647,
 "description": "Tailwind Traders wants to improve the security of their workloads that are running in the cloud. In this session, learn how to use: Azure Security Center to determine how to configure Azure resources (using security best practices), Azure Sentinel to locate and respond to suspicious activity, and Azure Bastion for secure administrative connections into Azure.\r\n",
 "registrationLink": "",
 "roomId": "",
 "location": "Sheikh Rashid Hall F",
 "buildingLocation": null,
 "startDateTime": "2020-02-10T11:15:00+00:00",
 "endDateTime": "2020-02-10T12:00:00+00:00",
 "durationInMinutes": 45,
 "sessionType": "Module: 45 Minute",
 "sessionTypeLogical": "Module: 45 Minute",
 "learningPath": "Azure fundamentals",
 "level": "",
 "products": [],
 "format": "",
 "topic": "",
 "sessionTypeId": "3107",
 "slideDeck": "",
 "isMandatory": false,
 "visibleToAnonymousUsers": true,
 "visibleInSessionListing": true,
 "canBeEvaluated": true,
 "liveStream": "",
 "onDemand": "",
 "translatorLink": "",
 "onDemandThumbnail": "",
 "techCommunityDiscussionId": "907397",
 "speakerIds": [
  "707101"
 ],
 "speakerNames": [
  "Tiberiu George Covaci"
 ],
 "speakerCompanies": [
  "Cloudeon A/S"
 ],
 "sessionSets": [
  "Session Catalog 2019",
  "Session Scheduler",
  "My Schedule"
 ],
 "sessionLinks": [],
 "marketingCampaign": [],
 "overflowStatus": "",
 "links": "",
 "waitlistCapacity": 2147483647,
 "waitlistCount": 0,
 "lastUpdate": "2020-01-31T03:30:14.801+00:00",
 "techCommunityUrl": "",
 "overflowRooms": [],
 "childModules": [],
 "siblingModules": [
  {
   "sessionId": 86430,
   "title": "Discovering Microsoft Azure",
   "startDateTime": "2020-02-10T06:45:00+00:00",
   "endDateTime": "2020-02-10T07:45:00+00:00",
   "durationInMinutes": 60,
   "speakerIds": [],
   "speakerNames": [],
   "speakerCompanies": [],
   "description": "New developers at Tailwind Traders have a saying about learning our technology platform: \"it's like drinking from a firehose.\" Indeed, learning all Microsoft Azure services can seem overwhelming – especially if you're unfamiliar with Azure or the cloud in general. In this session, we start at the beginning, introducing Azure and the core concepts that are foundational to our cloud platform. We start with a discussion of what cloud computing is and what Azure offers you and your team. We then take a look at basic services and features, setting up an account and subscription along the way. Finally, we tour the Azure Portal and do a quick overview of the resources available and what they do.\r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86431,
   "title": "Azure networking basics",
   "startDateTime": "2020-02-10T08:15:00+00:00",
   "endDateTime": "2020-02-10T09:00:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "715291"
   ],
   "speakerNames": [
    "Bradley Stewart"
   ],
   "speakerCompanies": [],
   "description": "Now that Tailwind Traders has decided to take the journey into the cloud, they need to understand how their applications and services communicate with each other, the internet, and on-premises networks. In this session, we cover the basics of Azure networking: what it is, how it differs from on-premises, and how to take full advantage of its capabilities. We then learn how the virtual machines in your new network can communicate with each other over the internet and our on-premises network, using Virtual Network Peering, site-to-site VPN, and Azure ExpressRoute. Finally, we discuss how you to optimize, using Azure Traffic Manager.\r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86434,
   "title": "Discovering Azure tooling and utilities",
   "startDateTime": "2020-02-10T10:00:00+00:00",
   "endDateTime": "2020-02-10T10:45:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "717897"
   ],
   "speakerNames": [
    "Bernd Verst"
   ],
   "speakerCompanies": [],
   "description": "Microsoft Azure allows you to build your applications with the full power and resilience of the cloud. But, how do you do that? In this session, we show you the tools that Tailwind Traders uses on a daily basis, including the Visual Studio Code editor and its Azure extension. We also introduce you to the Azure Cloud Shell, which allows you to work with Azure resources - without the need for the Portal. Finally, we show you how Azure Resource Management (ARM) templates save you time and help you automate infrastructure, reducing the chance of errors that come with manual human input.\r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86429,
   "title": "Storing data in Azure",
   "startDateTime": "2020-02-10T12:30:00+00:00",
   "endDateTime": "2020-02-10T13:15:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "719728"
   ],
   "speakerNames": [
    "April Edwards"
   ],
   "speakerCompanies": [],
   "description": "Tailwind Traders deals with gigantic amounts of data, continually pouring in from sources such as sales, marketing, and fulfillment. In the past, the only choice they had was to put it all into a relational database in a data center. However, by moving to Microsoft Azure, they can now optimize their data storage with increased scalability and resilience. In this session, we will introduce the various storage options available on Azure, from blob to SQL databases. You’ll learn about Azure Cosmos DB, a globally distributed, multi-model database, as well as SQL Data Warehouse and Data Factory.\r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86433,
   "title": "Exploring containers and orchestration in Azure",
   "startDateTime": "2020-02-11T07:00:00+00:00",
   "endDateTime": "2020-02-11T07:45:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "726799"
   ],
   "speakerNames": [
    "Hatim Nagarwala"
   ],
   "speakerCompanies": [],
   "description": "Tailwind Traders is in the process of moving from pure virtual machine workloads to using containers to run their apps. In this session, you’ll learn the ins and outs of containers versus VMs (and when to use one over the other) and get an overview of Azure Container Service, including container orchestration with Azure Kubernetes Service. \r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86447,
   "title": "Keeping costs down in Azure",
   "startDateTime": "2020-02-11T08:15:00+00:00",
   "endDateTime": "2020-02-11T09:00:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [],
   "speakerNames": [],
   "speakerCompanies": [],
   "description": "Tailwind Traders wants to keep the costs of running their workloads in Azure predictable and within the organization's spending limits. In this session, you'll learn about the factors that go into Azure costs and hear some tips and tools to keep costs manageable - from using Azure calculators and setting spending limits and quotas to utilizing tagging to identify cost owners.\r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86616,
   "title": "What you need to know about governance in Azure",
   "startDateTime": "2020-02-11T10:00:00+00:00",
   "endDateTime": "2020-02-11T10:45:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [],
   "speakerNames": [],
   "speakerCompanies": [],
   "description": "Tailwind Traders wants to make sure that their current and future Azure workloads adhere to a strict set of deployment and configuration guidelines. In this session, you'll learn how Tailwind Traders implements Azure governance technologies and best practices, like role-based access controls, to meet its compliance obligations and goals.",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86448,
   "title": "Azure identity fundamentals",
   "startDateTime": "2020-02-11T11:15:00+00:00",
   "endDateTime": "2020-02-11T12:00:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "719747"
   ],
   "speakerNames": [
    "Roelf Zomerman"
   ],
   "speakerCompanies": [],
   "description": "Identity is the core of most workloads in Azure, and Tailwind Traders wants to implement Azure Active Directory in a way that correctly meshes their on-premises identities with those required in the cloud. In this session, learn the difference between authentication and authorization, as well as different identity models. Then, dive into the benefits of conditional access and multi-factor authentication (MFA) and wrap up with a demo showing you how to implement these types of extra protection.\r\n",
   "location": "Sheikh Rashid Hall F"
  },
  {
   "sessionId": 86450,
   "title": "Figuring out Azure functions",
   "startDateTime": "2020-02-11T12:30:00+00:00",
   "endDateTime": "2020-02-11T13:15:00+00:00",
   "durationInMinutes": 45,
   "speakerIds": [
    "715283"
   ],
   "speakerNames": [
    "Christian Nwamba"
   ],
   "speakerCompanies": [],
   "description": "Tailwind Traders is curious about the concept behind “serverless” computing – the idea that they can run small pieces of code in the cloud, without having to worry about the underlying infrastructure. In this session, we’ll cover the world of Azure Functions, starting with an explanation of the servers behind serverless, exploring the languages and integrations available, and ending with a demo of when to use Logic Apps and Microsoft Flow.\r\n",
   "location": "Sheikh Rashid Hall F"
  }
 ]
}